app/controllers/url_shortners_controller.rb

  def index
    @url_shortners = UrlShortner.all
---
SELECT "url_shortners".* FROM "url_shortners"

  def create
    @url_shortner = UrlShortner.new(url_shortner_params)

    respond_to do |format|
      if @url_shortner.save
---
INSERT INTO "url_shortners" ("original_url", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["original_url", "http://www.webdesignermag.co.uk/build-a-custom-url-shortener-with-ruby-and-sinatra/"], ["created_at", "2016-04-05 12:06:54.810328"], ["updated_at", "2016-04-05 12:06:54.810328"]]

  def destroy
    @url_shortner.destroy
---
DELETE FROM "url_shortners" WHERE "url_shortners"."id" = $1  [["id", 5]]

    def set_url_shortner
      @url_shortner = UrlShortner.find(params[:id])
---
SELECT  "url_shortners".* FROM "url_shortners" WHERE "url_shortners"."id" = $1 LIMIT 1  [["id", 5]]